.open marks.db

DROP TABLE IF EXISTS students;
DROP TABLE IF EXISTS labs;
DROP TABLE IF EXISTS attendance;
DROP TABLE IF EXISTS marks;


CREATE TABLE students (
	id INTEGER PRIMARY KEY,
	name CHAR,
	group_ INTEGER
);

CREATE TABLE labs (
	id INTEGER PRIMARY KEY,
	name CHAR,
	max_mark INTEGER,
	group_ INTEGER,
	term DATE
);


CREATE TABLE attendance (
	id INTEGER PRIMARY KEY,
	student_id INTEGER,
	time_stamp DATETIME
);

CREATE TABLE marks (
	id INTEGER PRIMARY KEY,
	student_id INTEGER,
	lab_id INTEGER,
	mark FLOAT
);


INSERT INTO attendance (student_id, time_stamp) VALUES
(28, '20-03-2021  9:08:55'),
(37, '20-03-2021  9:16:57'),
(46, '20-03-2021  9:17:21'),
(41, '20-03-2021  9:17:33'),
(45, '20-03-2021  9:18:23'),
(33, '20-03-2021  9:23:34'),
(29, '20-03-2021  10:34:03'),
(27, '20-03-2021  10:34:20'),
(35, '20-03-2021  10:35:16'),
(50, '20-03-2021  10:43:19'),
(51, '20-03-2021  10:48:06'),
(39, '20-03-2021  10:48:26'),
(44, '20-03-2021  10:53:11'),
(43, '20-03-2021  11:09:48'),
(49, '20-03-2021  11:51:37'),
(48, '20-03-2021  11:51:43'),
(47, '20-03-2021  11:59:14'),
(43, '20-03-2021  11:09:48');

INSERT INTO students (name, group_) VALUES
('Александров К.В.', 402),
('Антонов К.Ю.', 402),
('Арянов В.А.', 402),
('Ахунзада Г.А.', 402),
('Балашов В.В.', 402),
('Бикмаев Р.Р.', 402),
('Булатова Г.Р.', 402),
('Гераськин В.М.', 402),
('Гурьков Н.Д.', 402),
('Дурнаев Н.С.', 402),
('Егоров О.А.', 402),
('Кокулов А.Ф.', 402),
('Кудашкин А.Е.', 402),
('Лихорадов И.И.', 402),
('Логинов А.Д.', 402),
('Ломайкин А.С.', 402),
('Макушев В.А.', 402),
('Макшев Н.И.', 402),
('Матвеев М.Д.', 402),
('Плаксин Д.В.', 402),
('Сазонов А.В.', 402),
('Седики Х.Ю.', 402),
('Сюсин А.В.', 402),
('Тростин С.А.', 402),
('Шабарин И.А.', 402),
('Алексеев Алексей', 303),
('Ашрятова Римма', 303),
('Борисов Александр', 303),
('Гарин Максим', 303),
('Головатюк Анастасия', 303),
('Горбунов Андрей', 303),
('Гуськов Артем', 303),
('Дворянинова Дарья', 303),
('Еделева Юлия', 303),
('Зевайкин Андрей', 303),
('Исоков Асадбек', 303),
('Казакова Ирина', 303),
('Квашнин Кирилл', 303),
('Кирдюшкин Данила', 303),
('Козина Светлана', 303),
('Козлова Екатерина', 303),
('Котков Сергей', 303),
('Ландышев Александр', 303),
('Логинов Виталий', 303),
('Малов Кирилл', 303),
('Манин Данила', 303),
('Маслова Елена', 303),
('Паршин Артем', 303),
('Пузин Владислав', 303),
('Сайфетдинов Салават', 303),
('Симатов Вадим', 303);




INSERT INTO labs (name, max_mark, group_, term) VALUES
('1', 5, 303, '2021-02-06'),
('2', 5, 303, '2021-02-20'),
('3', 5, 303, '2021-02-27'),
('4', 6, 303, '2021-03-13'),
('5', 6, 303, '2021-03-27'),
('6', 8, 303, '2021-04-10'),
('7', 8, 303, '2021-04-24'),
('к/р', 6, 303, '2021-04-17'),
('8', 6, 303, '2021-05-01'),
('9', 5, 303, '2021-05-22'),
('10', 5, 303, '2021-06-02'),
('1', 8, 402, '2021-02-06'),
('2', 8, 402, '2021-02-13'),
('3', 9, 402, '2021-02-27'),
('4', 12, 402, '2021-03-13'),
('5', 12, 402, '2021-03-27'),
('6', 12, 402, '2021-04-10'),
('7', 9, 402, '2021-04-17');

